Тест/Тест/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/CommonModules/РасчетСрокаОкупаемостиАвто/Module.bsl
//Волков ИО 09.02.24 ++
Процедура РасчетСрокаОкупаемостиАвто() Экспорт
		
	Авто = "";
	СуммаАвто = 0;
	ДатаПоступленияАвто = '00010101';
	ДатаКогдаРентабельностьНоль = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Машины.Ссылка КАК Ссылка,
	|	Машины.Сумма КАК Сумма,
	|	Машины.Дата КАК ДатаПоступленияАвто,
	|	Машины.ДатаОкупаемостиАвто КАК ДатаОкупаемостиАвто,
	|	Машины.СрокОкупаемостиВМесяцах КАК СрокОкупаемостиВМесяцах
	|ИЗ
	|	Справочник.Машины КАК Машины";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		//Отбираем машину Проверяем заполненость рекв СрокОкупаемостиВМес. Если заполнен - расчеты не производятся.  
		СрокОкупаемостиВМес = РезультатЗапроса.СрокОкупаемостиВМесяцах;
		Если Не ЗначениеЗаполнено(СрокОкупаемостиВМес) Тогда 
			Авто = РезультатЗапроса.Ссылка;
			СуммаАвто = РезультатЗапроса.Сумма;	
			ДатаПоступленияАвто =  РезультатЗапроса.ДатаПоступленияАвто;
			//Смотрим все документы продаж по машине, Отбираем документ, когда СуммаПродаж с авто > Стоимости машины. Записываем дату в рекв. ДатаОкупаемостиАвто 
			ДатаКогдаРентабельностьНоль = РасчитатьДатуОкупаемостиАвто(Авто, СуммаАвто, ДатаПоступленияАвто);	
			ОбъектСправочника = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ОбъектСправочника.ДатаОкупаемостиАвто = ДатаКогдаРентабельностьНоль;
			ОбъектСправочника.Записать();
			//Расчитываем срок окупаемости авто в месяцах. ДатаОкупаемости авто - ДатаПоступленияАвто
			РасчитатьСрокОкупаемостиВМесяцахАвто(Авто)
			
		Иначе
			
			Продолжить
			
		КонецЕсли		
		
	КонецЦикла;
	
КонецПроцедуры        

Процедура РасчитатьСрокОкупаемостиВМесяцахАвто(Авто)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Машины.Ссылка КАК Ссылка,
	|	Машины.Дата КАК Дата,
	|	Машины.ДатаОкупаемостиАвто КАК ДатаОкупаемостиАвто,
	|	РАЗНОСТЬДАТ(Машины.Дата, Машины.ДатаОкупаемостиАвто, МЕСЯЦ) КАК ОкупаемастьВМесяцах
	|ИЗ
	|	Справочник.Машины КАК Машины
	|ГДЕ
	|	Машины.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Авто);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ОкупаемастьВМесяцах = РезультатЗапроса.ОкупаемастьВМесяцах;
		
		ОбъектСправочника = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.СрокОкупаемостиВМесяцах = ОкупаемастьВМесяцах;
		ОбъектСправочника.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция  РасчитатьДатуОкупаемостиАвто(Авто, СуммаАвто, ДатаПоступленияАвто)
	
	СуммаПродаж = 0;
	ДатаКогдаРентабельностьНоль = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажаЗапчастейТаблица.Товар КАК Товар,
	|	ПродажаЗапчастейТаблица.машина КАК машина,
	|	ПродажаЗапчастейТаблица.Ссылка КАК Ссылка,
	|	ПродажаЗапчастейТаблица.Сумма КАК Сумма,
	|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
	|ГДЕ
	|	ПродажаЗапчастейТаблица.машина = &машина";
	
	Запрос.УстановитьПараметр("машина", Авто);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		СуммаПродаж = СуммаПродаж + РезультатЗапроса.Сумма;
		
		Если СуммаПродаж >= СуммаАвто Тогда 
			
			ДатаКогдаРентабельностьНоль	= РезультатЗапроса.ДатаДокумента;
			Возврат ДатаКогдаРентабельностьНоль; 
		КонецЕсли;
	КонецЦикла; 
	
КонецФункции     
//Волков ИО 09.02.24
